
#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azurerm_client_config.current: Reading...
azurerm_resource_group.baseRG: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03N2U1MTFmNi0wNjgyLTQxZDMtYTg0MC03NjU2NTY2YzBjY2E7b2JqZWN0SWQ9MjEwZTI0N2YtYjExNC00MGVkLWEzYjQtNTA0Yjc1NDI3MDg0O3N1YnNjcmlwdGlvbklkPTI2MDg2MjNlLTMyNmUtNDc2NS05NWZjLWI4ZjY1YTVjM2NiMTt0ZW5hbnRJZD1kMTk5MzkwMS1iYjUxLTQ5MmYtOGUwZC01NzJiMTM4NGYzYTY=]
azurerm_log_analytics_workspace.nicegui: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.OperationalInsights/workspaces/NiceGuiTest-LAW]
azurerm_container_registry.nicegui: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.ContainerRegistry/registries/NiceGuiTestACR]
azurerm_key_vault.nicegui: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.KeyVault/vaults/NiceGuiTest-KV]
azurerm_container_app_environment.nicegui: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.App/managedEnvironments/NiceGuiTest-ACE]
azurerm_key_vault_secret.ACR-URL: Refreshing state... [id=https://niceguitest-kv.vault.azure.net/secrets/ACR-URL/adb6cce3b053497f806352506d3488ef]
azurerm_key_vault_secret.ACR-PASS: Refreshing state... [id=https://niceguitest-kv.vault.azure.net/secrets/ACR-URL/d28448ead2084653896241c652547f58]
azurerm_key_vault_secret.ACR-USER: Refreshing state... [id=https://niceguitest-kv.vault.azure.net/secrets/ACR-URL/adb6cce3b053497f806352506d3488ef]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_key_vault.nicegui will be updated in-place
  ~ resource "azurerm_key_vault" "nicegui" {
      ~ access_policy                   = [
          ~ {
              ~ secret_permissions      = [
                    # (2 unchanged elements hidden)
                    "Set",
                  + "Delete",
                ]
                # (6 unchanged elements hidden)
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "e77f4946-6485-4d02-92ee-3445604733b8"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - storage_permissions     = []
              - tenant_id               = "d1993901-bb51-492f-8e0d-572b1384f3a6"
            },
        ]
        id                              = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.KeyVault/vaults/NiceGuiTest-KV"
        name                            = "NiceGuiTest-KV"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.ACR-PASS must be replaced
-/+ resource "azurerm_key_vault_secret" "ACR-PASS" {
      - content_type            = "" -> null
      ~ id                      = "https://niceguitest-kv.vault.azure.net/secrets/ACR-URL/d28448ead2084653896241c652547f58" -> (known after apply)
      ~ name                    = "ACR-URL" -> "ACR-PASS" # forces replacement
      ~ resource_id             = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.KeyVault/vaults/NiceGuiTest-KV/secrets/ACR-URL/versions/d28448ead2084653896241c652547f58" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.KeyVault/vaults/NiceGuiTest-KV/secrets/ACR-URL" -> (known after apply)
      - tags                    = {} -> null
      ~ value                   = (sensitive value)
      ~ version                 = "adb6cce3b053497f806352506d3488ef" -> (known after apply)
      ~ versionless_id          = "https://niceguitest-kv.vault.azure.net/secrets/ACR-URL" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.ACR-URL will be updated in-place
  ~ resource "azurerm_key_vault_secret" "ACR-URL" {
        id                      = "https://niceguitest-kv.vault.azure.net/secrets/ACR-URL/adb6cce3b053497f806352506d3488ef"
        name                    = "ACR-URL"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.ACR-USER must be replaced
-/+ resource "azurerm_key_vault_secret" "ACR-USER" {
      ~ id                      = "https://niceguitest-kv.vault.azure.net/secrets/ACR-URL/adb6cce3b053497f806352506d3488ef" -> (known after apply)
      ~ name                    = "ACR-URL" -> "ACR-USER" # forces replacement
      ~ resource_id             = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.KeyVault/vaults/NiceGuiTest-KV/secrets/ACR-URL/versions/adb6cce3b053497f806352506d3488ef" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.KeyVault/vaults/NiceGuiTest-KV/secrets/ACR-URL" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "adb6cce3b053497f806352506d3488ef" -> (known after apply)
      ~ versionless_id          = "https://niceguitest-kv.vault.azure.net/secrets/ACR-URL" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @Joey40, Action: `pull_request`, Workflow: `Terraform Plan/Apply`*